# College Major vs salaries
### Exploratory Data Analysis for 100DaysOfCode with Python. 
 __ Notebook created by Maria Magdalena Balos __

### Import

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv("day_72_data/salaries_by_college_major.csv")
df.head(10)

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business
5,Art History,35800.0,64900.0,28800.0,125000.0,HASS
6,Biology,38800.0,64800.0,36900.0,135000.0,STEM
7,Business Management,43000.0,72100.0,38800.0,147000.0,Business
8,Chemical Engineering,63200.0,107000.0,71900.0,194000.0,STEM
9,Chemistry,42600.0,79900.0,45300.0,148000.0,STEM

### Preliminary data exploration and data cleaning

How many rows does our dataframe have? How many columns does it have?

In [6]:
df.shape  # 51 rows  and 6 columns

(51, 6)

What are the labels for the columns? Do the columns have names?

In [7]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

Are there any missing values in our dataframe? Does our dataframe contain any bad data?

In [8]:
df.isna().value_counts()
# There is just a row that has NAN values

Undergraduate Major  Starting Median Salary  Mid-Career Median Salary  Mid-Career 10th Percentile Salary  Mid-Career 90th Percentile Salary  Group
False                False                   False                     False                              False                              False    50
                     True                    True                      True                               True                               True      1
Name: count, dtype: int64

In [9]:
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

Drop the missing values row as is has no relevant information

In [10]:
clean_df = df.dropna()
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

Work on individual columns

In [11]:
clean_df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

Checking the maximum salary from the dataset

In [12]:
max_salary = clean_df["Starting Median Salary"].max()

Check the index to find more about the college that earns this much on average.

In [13]:
max_index = clean_df["Starting Median Salary"].idxmax()
max_salary_college = clean_df['Undergraduate Major'].loc[max_index]

print(f"The highest salary in the dataset is: {max_salary} from the {max_salary_college} college.")

The highest salary in the dataset is: 74300.0 from the Physician Assistant college.

What college major has the **highest mid-career salary**? How much do graduates with this major earn? (Mid-career is defined as having 10+ years of experience).

In [14]:
clean_df.head()
mid_salary = clean_df["Mid-Career Median Salary"].max()


max_index_mid_career = clean_df["Mid-Career Median Salary"].idxmax()
clean_df.loc[max_index_mid_career]
college = clean_df["Undergraduate Major"].loc[max_index_mid_career]


print(f"The highest salary for mid-career is: {mid_salary} from the {college} college.")

The highest salary for mid-career is: 107000.0 from the Chemical Engineering college.

Which college major has the **lowest starting salary** and **how much do graduates earn after university**?

In [15]:
lowest_starting = clean_df["Starting Median Salary"].min()
lowest_starting_college_idx = clean_df["Starting Median Salary"].idxmin()
lowest_starting_college = clean_df["Undergraduate Major"][lowest_starting_college_idx]


lowest_starting_highest_sallary = clean_df["Mid-Career 90th Percentile Salary"][lowest_starting_college_idx]

print(f"The lowest starting salary in the dataset is: {lowest_starting} from the {lowest_starting_college} college.\n \
      The main career path after university can earn up to: {lowest_starting_highest_sallary}.")

The lowest starting salary in the dataset is: 34000.0 from the Spanish college.
       The main career path after university can earn up to: 96400.0.

Which college major has the **lowest mid-career salary** and how much can people expect to earn with this degree?

In [16]:
lowest_mid_career_salary = clean_df["Mid-Career 90th Percentile Salary"].min()
lowest_mid_career_salary_idx = clean_df["Mid-Career 90th Percentile Salary"].idxmin()
lowest_mid_career_salary_college = clean_df["Undergraduate Major"][lowest_starting_college_idx]

print(f"The lowest mid-career salary is: {lowest_mid_career_salary} and its college is {lowest_mid_career_salary_college}.")

The lowest mid-career salary is: 96400.0 and its college is Spanish.

### Data analysis for the lowest risk major

*A low-risk major is a degree where there is a small difference between the lowest and highest salaries. In other words, if the difference between the 10th percentile and the 90th percentile earnings of your major is small, then you can be more certain about your salary after you graduate.*

In [17]:
spread_col = clean_df["Mid-Career 90th Percentile Salary"] - clean_df["Mid-Career 10th Percentile Salary"]  # Checking for the difference 
clean_df.insert(1, "Spread", spread_col)  # Adding a new column to the df at position 1
clean_df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

In [18]:
low_risk = clean_df.sort_values("Spread")
low_risk[["Undergraduate Major", "Spread"]].head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

Using the .sort_values() method, can you **find the degrees with the highest potential**? **Find the top 5 degrees with the highest values in the 90th percentile**.

In [19]:
highest_potential_90th = clean_df.sort_values("Mid-Career 90th Percentile Salary", ascending= False)
highest_potential_90th[["Undergraduate Major", "Mid-Career 90th Percentile Salary"]].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

Also, find the degrees with **the greatest spread in salaries**. Which majors have the largest difference between high and low earners after graduation.

In [20]:
highest_spread_90th = clean_df.sort_values("Spread", ascending=False)
highest_spread_90th[["Undergraduate Major", "Spread"]].head()

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

Comparing the spread of the 90th percentil with the middle one.

In [21]:
highest_spread_middle = clean_df.sort_values("Mid-Career Median Salary", ascending= False)
highest_spread_middle[["Undergraduate Major", "Mid-Career Median Salary"]].head()

       Undergraduate Major  Mid-Career Median Salary
8     Chemical Engineering                  107000.0
12    Computer Engineering                  105000.0
19  Electrical Engineering                  103000.0
1    Aerospace Engineering                  101000.0
17               Economics                   98600.0

### Grouping and pivoting tables with pandas

Now can you use the .mean() method to find the average salary by group?

In [22]:
clean_df.groupby('Group').count()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16

Droping the college category creating a new dataframe for this challenge

In [23]:
new_dataset = clean_df.drop("Undergraduate Major", axis=1)
new_dataset.head()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,85400.0,41600.0,76800.0,50600.0,136000.0,Business

Changing the notebook format to be able to read better the data

In [24]:
pd.options.display.float_format = '{:,.2f}'.format

Aplying the mean function in the new data frame

In [25]:
new_dataset.groupby('Group').mean()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"